what --> pandas is a library, which is used for analytical purpose.
why ==> to find the patterns
how

In [1]:
data = {
    "A": [1, 2, 3],
    "B": [4, 5, 6],
    "C": [7, 8, 9]
}
data

{'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}

In [2]:
type(data)

dict

In [3]:
import pandas as pd

In [4]:
# pip install pandas 
pd.DataFrame(data=data)

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [7]:
data = {
    "A": [1, 2, 3],
    "B": [4, 5,  6],
    "C": [7, 8, 9]
}

In [10]:
df = pd.DataFrame(data)
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [11]:
# shape of the df
df.shape

(3, 3)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 200.0 bytes

In [13]:
df.head()

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [14]:
df.head(1)

   A  B  C
0  1  4  7

In [15]:
df.head(0)

Empty DataFrame
Columns: [A, B, C]
Index: []

In [16]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [17]:
data = {
    "A": [1, 2, 3],
    "B": [4, 5,  6],
    "C": [7, 8, 9]
}

In [33]:
df1 = pd.DataFrame(data=data, index=['X', 'Y', 'Z'])

df1

   A  B  C
X  1  4  7
Y  2  5  8
Z  3  6  9

In [34]:
df1 = pd.DataFrame(data=data)
df1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [35]:
# set_index
df2 = df1.set_index('A')

In [36]:
df1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [37]:
df2

   B  C
A
1  4  7
2  5  8
3  6  9

In [39]:
df1.set_index('A', inplace=True)

In [40]:
df1

   B  C
A
1  4  7
2  5  8
3  6  9

In [41]:
df1.index

Int64Index([1, 2, 3], dtype='int64', name='A')

In [42]:
# reset index
df1.reset_index()

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [53]:
# duplicate records
data = {
    "A": [1, 1, 2, 3, 3],
    "B": ["x", "x", "y", "z", "z"],
    "C": ["foo", "foo", "bar", "baz", "baz"]
}

df3 = pd.DataFrame(data)
df3

   A  B    C
0  1  x  foo
1  1  x  foo
2  2  y  bar
3  3  z  baz
4  3  z  baz

In [59]:
df4 = df3.drop_duplicates() # drop duplicates in my df (or) get unique records
df4

   A  B    C
0  1  x  foo
2  2  y  bar
3  3  z  baz

In [58]:
df3

   A  B    C
0  1  x  foo
1  1  x  foo
2  2  y  bar
3  3  z  baz
4  3  z  baz

In [73]:
data = {
    "id": [1, 2, 3, 4, 5],
    "email": ["john@mail.com", "alice@gmail.com", "john@mail.com", "emma@outlook.com", "james@outlook.com"]
}

df5 = pd.DataFrame(data)
df5

   id              email
0   1      john@mail.com
1   2    alice@gmail.com
2   3      john@mail.com
3   4   emma@outlook.com
4   5  james@outlook.com

In [74]:
df5.drop_duplicates() # if entire row is duplicated then only i will remove it.

   id              email
0   1      john@mail.com
1   2    alice@gmail.com
2   3      john@mail.com
3   4   emma@outlook.com
4   5  james@outlook.com

In [75]:
df5.drop_duplicates(subset=['email'])

   id              email
0   1      john@mail.com
1   2    alice@gmail.com
3   4   emma@outlook.com
4   5  james@outlook.com

In [76]:
df5

   id              email
0   1      john@mail.com
1   2    alice@gmail.com
2   3      john@mail.com
3   4   emma@outlook.com
4   5  james@outlook.com

In [77]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [78]:
df5.columns

Index(['id', 'email'], dtype='object')

In [81]:
data = {
    'name': ['Anji', 'Lakshman', 'Ram', 'Sita'],
    'marks': [90, 60, 100, 99]
}

df1 = pd.DataFrame(data)
df1

       name  marks
0      Anji     90
1  Lakshman     60
2       Ram    100
3      Sita     99

In [82]:
data['marks']

[90, 60, 100, 99]

In [83]:
df1['marks']

0     90
1     60
2    100
3     99
Name: marks, dtype: int64

In [95]:
condition1 = df1['marks'] >= 90

In [91]:
df1[condition]

   name  marks
0  Anji     90
2   Ram    100
3  Sita     99

In [97]:
df1

       name  marks
0      Anji     90
1  Lakshman     60
2       Ram    100
3      Sita     99

In [96]:
condition2 = (df1['name']  == 'Sita')

In [109]:
df1[condition1 & condition2]

   name  marks
3  Sita     99

In [110]:
df1

       name  marks
0      Anji     90
1  Lakshman     60
2       Ram    100
3      Sita     99

In [111]:
df1.isna()

    name  marks
0  False  False
1  False  False
2  False  False
3  False  False

In [121]:
import numpy as np
data = {
    'name': ['Anji', 'Lakshman', 'Ram', 'Sita', 'Ravan'],
    'marks': [90, 60, 100, 99, np.nan]
}
df1 = pd.DataFrame(data)
df1

       name  marks
0      Anji   90.0
1  Lakshman   60.0
2       Ram  100.0
3      Sita   99.0
4     Ravan    NaN

In [113]:
df1.isna() # to get null records

    name  marks
0  False  False
1  False  False
2  False  False
3  False  False
4  False   True

In [115]:
df1.isnull()

    name  marks
0  False  False
1  False  False
2  False  False
3  False  False
4  False   True

In [116]:
df1

       name  marks
0      Anji   90.0
1  Lakshman   60.0
2       Ram  100.0
3      Sita   99.0
4     Ravan    NaN

In [122]:
df1.dropna() #  if a single record is null then removes the entire row

       name  marks
0      Anji   90.0
1  Lakshman   60.0
2       Ram  100.0
3      Sita   99.0

In [124]:
df1

       name  marks
0      Anji   90.0
1  Lakshman   60.0
2       Ram  100.0
3      Sita   99.0
4     Ravan    NaN

In [125]:
df1.dropna(subset=['name'])

       name  marks
0      Anji   90.0
1  Lakshman   60.0
2       Ram  100.0
3      Sita   99.0
4     Ravan    NaN

In [129]:
df1.fillna('missing')

       name    marks
0      Anji     90.0
1  Lakshman     60.0
2       Ram    100.0
3      Sita     99.0
4     Ravan  missing

In [130]:
df1

       name  marks
0      Anji   90.0
1  Lakshman   60.0
2       Ram  100.0
3      Sita   99.0
4     Ravan    NaN

In [131]:
df1.describe()

            marks
count    4.000000
mean    87.250000
std     18.714967
min     60.000000
25%     82.500000
50%     94.500000
75%     99.250000
max    100.000000